ua1arn/hftrx/boards/arm_stm32mp1xx_ctlstyle_PanGuBoard_v1p2.h
#if WITHISBOOTLOADER

	// +++ заглушки для плат с DSP обработкой
	
	

//	#define BOARD_DETECTOR_AM 	0		// Заглушка
//	#define BOARD_DETECTOR_FM 	0		// Заглушка
//	#define BOARD_DETECTOR_MUTE 	0		// Заглушка
//	#define BOARD_DETECTOR_TUNE 	0		// Заглушка

	// +++ заглушки для плат с DSP обработкой
	#define BOARD_NOTCH_OFF		0
	#define BOARD_NOTCH_MANUAL	0
	#define BOARD_NOTCH_AUTO	0

	#define NVRAM_TYPE NVRAM_TYPE_NOTHING	// нет NVRAM
	#define HARDWARE_IGNORENONVRAM	1		// отладка на платах где нет никакого NVRAM

	//#define WITHWATCHDOG	1	/* разрешение сторожевого таймера в устройстве */
	#define DDS1_CLK_DIV	1		/* Делитель опорной частоты перед подачей в DDS1 */
	//#define WITHSMPSYSTEM	1	/* разрешение поддержки SMP, Symmetric Multiprocessing */
	//
	
	//#define WITHUSESDCARD		1	// Включение поддержки SD CARD
	//#define WITHUSESDCARD		1	// Включение поддержки SD CARD
	#define WITHUSEUSBFLASH		1	// Включение поддержки USB memory stick

#else /* WITHISBOOTLOADER */

	// +++ заглушки для плат с DSP обработкой
	
	

//	#define BOARD_DETECTOR_AM 	0		// Заглушка
//	#define BOARD_DETECTOR_FM 	0		// Заглушка
//	#define BOARD_DETECTOR_MUTE 	0		// Заглушка
//	#define BOARD_DETECTOR_TUNE 	0		// Заглушка

	// +++ заглушки для плат с DSP обработкой
	#define BOARD_NOTCH_OFF		0
	//#define BOARD_NOTCH_MANUAL	0
	//#define BOARD_NOTCH_AUTO	0

	#define ENCRES_DEFAULT ENCRES_128
	//#define ENCRES_DEFAULT ENCRES_24
	#define WITHDIRECTFREQENER	1 // прямой ввод частоты с клавиш
	//#define WITHENCODER	1	/* для изменения частоты имеется енкодер */
	
	
	//#define WITHENCODER2	1		/* есть второй валкодер */
	#define BOARD_ENCODER2_DIVIDE 4		/* значение для валкодера PEC16-4220F-n0024 (с трещёткой") */
	/* Board hardware configuration */

	#define CODEC1_TYPE CODEC_TYPE_CS42L51
	//#define CODEC1_TYPE CODEC_TYPE_TLV320AIC23B
	//#define CODEC_TYPE_TLV320AIC23B_USE_SPI	1
	//#define CODEC_TYPE_TLV320AIC23B_USE_8KS	1	/* кодек работает с sample rate 8 kHz */

	//#define CODEC_TYPE_WM8731_USE_SPI	1
	//#define CODEC_TYPE_WM8731_USE_8KS	1	/* кодек работает с sample rate 8 kHz */

	//#define CODEC1_TYPE CODEC_TYPE_NAU8822L
	//#define CODEC_TYPE_NAU8822_USE_SPI	1
	//#define CODEC_TYPE_NAU8822_USE_8KS	1	/* кодек работает с sample rate 8 kHz */

	
	//#define WITHBBOXMIKESRC BOARD_TXAUDIO_LINE

	//#define CODEC2_TYPE	CODEC_TYPE_FPGAV1	/* квадратуры получаем от FPGA */
	//#define CODEC_TYPE_CS4272_USE_SPI	1		// codecboard v2.0
	//#define CODEC_TYPE_CS4272_STANDALONE	1		// codecboard v3.0

	#define WITHFPGAIF_FRAMEBITS 256	// Полный размер фрейма
	//#define WITHFPGARTS_FRAMEBITS 64	// Полный размер фрейма для двух квадратур по 24 бита - канал спектроанализатора
	#define WITHFPGAIF_FORMATI2S_PHILIPS 1	// требуется при получении данных от FPGA
	//#define WITHFPGARTS_FORMATI2S_PHILIPS 1	// требуется при получении данных от FPGA
	#define CODEC1_FORMATI2S_PHILIPS 1	// Возможно использование при передаче данных в кодек, подключенный к наушникам и микрофону
	#define CODEC1_FRAMEBITS 64		// Полный размер фрейма для двух каналов - канал кодека
	#define CODEC1_IFC_MASTER 1	// кодек формирует синхронизацию

	//#define WITHWATCHDOG	1	/* разрешение сторожевого таймера в устройстве */
	#define WITHSMPSYSTEM	1	/* разрешение поддержки SMP, Symmetric Multiprocessing */
	//
	#define WITHINTEGRATEDDSP		1	/* в программу включена инициализация и запуск DSP части. */

	// FPGA section
	//#define WITHFPGAWAIT_AS	1	/* FPGA загружается из собственной микросхемы загрузчика - дождаться окончания загрузки перед инициализацией SPI в процессоре */
	////#define WITHFPGALOAD_PS	1	/* FPGA загружается процессором с помощью SPI */

	//#define WITHSKIPUSERMODE 1	// debug option: не отдавать в USER MODE блоки для фильтрации аудиосигнала
	//#define WITHNOSPEEX	1	// Без шумоподавителя SPEEX
	#define WITHUSEDUALWATCH	1	// Второй приемник
	#define WITHREVERB	1	// ревербератор в обработке микрофонного сигнала
	//#define WITHLOOPBACKTEST	1	/* прослушивание микрофонного входа, генераторов */
	//#define WITHMODEMIQLOOPBACK	1	/* модем получает собственные передаваемые квадратуры */

	//#define WITHUSESDCARD		1	// Включение поддержки SD CARD
	#define WITHUSEUSBFLASH		1	// Включение поддержки USB memory stick
	//#define WITHUSERAMDISK			1			// создание FATFS диска в озу
	//#define WITHUSERAMDISKSIZEKB	(192uL * 1024)	// размр в килобайтах FATFS диска в озу

	//#define WITHUSEAUDIOREC		1	// Запись звука на SD CARD
	//#define WITHUSEAUDIOREC2CH	1	// Запись звука на SD CARD в стерео
	//#define WITHUSEAUDIORECCLASSIC	1	// стандартный формат записи, без "дыр"
	

	#define WITHRTS96 1		/* Получение от FPGA квадратур, возможно передача по USB и отображение спектра/водопада. */
	#if LCDMODE_AT070TNA2 || LCDMODE_AT070TN90
		//#define BOARD_FFTZOOM_POW2MAX 1	// Возможные масштабы FFT x1, x2
		//#define BOARD_FFTZOOM_POW2MAX 2	// Возможные масштабы FFT x1, x2, x4
		#define BOARD_FFTZOOM_POW2MAX 3	// Возможные масштабы FFT x1, x2, x4, x8
		//#define BOARD_FFTZOOM_POW2MAX 4	// Возможные масштабы FFT x1, x2, x4, x8, x16
		#define WITHFFTSIZEWIDE 1024		/* Отображение спектра и волопада */
		#define WITHDISPLAYSWR_FPS 15
		#define WITHAFSPECTRE		1		/* показ спктра прослушиваемого НЧ сигнала. */
		#define WITHFFTSIZEAF 		256		/* Отображение спектра НЧ сигнвлв */
		#if 0
			#define WITHTOUCHGUI		1
			#define WITHAFSPECTRE		1	/* показ спктра прослушиваемого НЧ сигнала. */
			#define WITHALPHA			64
			#define FORMATFROMLIBRARY 	1
			
//			#define WITHALTERNATIVEFONTS    1
//			#define WITHALTERNATIVELAYOUT    1
		#endif
	#elif LCDMODE_LQ043T3DX02K
		//#define BOARD_FFTZOOM_POW2MAX 1	// Возможные масштабы FFT x1, x2
		//#define BOARD_FFTZOOM_POW2MAX 2	// Возможные масштабы FFT x1, x2, x4
		#define BOARD_FFTZOOM_POW2MAX 3	// Возможные масштабы FFT x1, x2, x4, x8
		//#define BOARD_FFTZOOM_POW2MAX 4	// Возможные масштабы FFT x1, x2, x4, x8, x16
		#define WITHFFTSIZEWIDE 512		/* Отображение спектра и волопада */
		#define WITHDISPLAYSWR_FPS 15
		//#define WITHAFSPECTRE		1		/* показ спктра прослушиваемого НЧ сигнала. */
		//#define WITHFFTSIZEAF 		256		/* Отображение спектра НЧ сигнвлв */
	#endif /* LCDMODE_AT070TNA2 || LCDMODE_AT070TN90 */

	#define WITHVIEW_3DSS		1
	#define WITHVIEW_3DSS_MARK	1	/* Для VIEW_3DSS - индикация полосы пропускания на спектре */

